In [1]:
import pandas as pd

ratings = pd.read_csv("./data/all_ratings_simplified.csv")
print(len(ratings['user'].unique()))

user_counts = ratings.groupby('user').count().reset_index()

filtered_users = user_counts[user_counts['date'] >= 2]['user']
filtered_df = ratings[ratings['user'].isin(filtered_users)]
len(filtered_df['user'].unique())

20537432

9611600

In [2]:
filtered_df.head()

   mark     product      date      user
0   5.0  0001713353  20161003  16201208
1   5.0  0001713353  20160729    225610
2   5.0  0001713353  20160620  18037271
3   5.0  0001713353  20160424   8215727
4   5.0  0001713353  20160214   8084801

In [13]:
import json

unique_products = filtered_df['product'].unique()
product_to_int = {product: i for i, product in enumerate(unique_products)}
filtered_df['product_int'] = filtered_df['product'].map(product_to_int)

int_to_product = {i: product for product, i in product_to_int.items()}
with open("./data/int_to_product.json", "w") as f:
    json.dump(int_to_product, f)

def write_group(group):
    return ' '.join(map(str, group['product_int'].tolist()))

grouped = filtered_df.groupby('user').apply(write_group).reset_index(name='items')

with open('spmf/input.txt', 'w') as f:
    for items in grouped['items']:
        f.write(f"{items}\n")

C:\Users\RINGULARITY\AppData\Local\Temp\ipykernel_8164\930274612.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df['product_int'] = filtered_df['product'].map(product_to_int)

In [14]:
import subprocess

spmf_jar_path = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf.jar"

input_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\input.txt"
output_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\apriori.txt"

process = subprocess.Popen([r'C:\Program Files\Java\jdk-20\bin\java', '-jar', spmf_jar_path, 'run', 'Apriori', input_file, output_file, '0.25%'],
                           stderr=subprocess.PIPE)
stdout, stderr = process.communicate()

with open(output_file, 'r') as f:
    for line in f:
        print(line.strip())

print("STDERR:", stderr.decode())

343 #SUP: 4242
358 #SUP: 4242
679 #SUP: 1695
905 #SUP: 1819
1180 #SUP: 1785
1347 #SUP: 4240
1763 #SUP: 2375
1774 #SUP: 1737
2160 #SUP: 2246
2664 #SUP: 1606
2976 #SUP: 4292
3168 #SUP: 2236
3773 #SUP: 5573
3816 #SUP: 1712
4298 #SUP: 2145
4396 #SUP: 4222
4696 #SUP: 4869
4804 #SUP: 2370
4906 #SUP: 1802
5014 #SUP: 2931
6536 #SUP: 1922
6563 #SUP: 6550
6611 #SUP: 2030
6680 #SUP: 2380
6696 #SUP: 2213
6903 #SUP: 2892
7220 #SUP: 1719
7241 #SUP: 2072
7243 #SUP: 2527
7272 #SUP: 1623
7304 #SUP: 2087
7345 #SUP: 2483
7586 #SUP: 6828
7801 #SUP: 1632
7831 #SUP: 2800
8033 #SUP: 7548
8040 #SUP: 7908
10125 #SUP: 4211
10283 #SUP: 1627
10426 #SUP: 1698
10429 #SUP: 1622
10475 #SUP: 2936
10736 #SUP: 1828
11367 #SUP: 2823
11391 #SUP: 2096
11788 #SUP: 2074
12713 #SUP: 2205
12783 #SUP: 1665
12924 #SUP: 2139
12957 #SUP: 4587
13399 #SUP: 2391
13455 #SUP: 1717
13843 #SUP: 4980
13850 #SUP: 3643
14170 #SUP: 1803
14171 #SUP: 1878
15141 #SUP: 1596
15328 #SUP: 2762
15402 #SUP: 1818
15446 #SUP: 2028
15749 #SUP: 2051
15976 #SUP: 2119
16075 #SUP: 1766
16205 #SUP: 1857
17138 #SUP: 1998
17225 #SUP: 1615
17520 #SUP: 4275
17550 #SUP: 2089
17614 #SUP: 2450
17772 #SUP: 2997
17991 #SUP: 3075
18178 #SUP: 1947
18319 #SUP: 2202
18344 #SUP: 4212
18350 #SUP: 2805
18367 #SUP: 3385
18372 #SUP: 2463
19847 #SUP: 3764
19940 #SUP: 1745
20262 #SUP: 4770
20270 #SUP: 1740
21514 #SUP: 1742
21592 #SUP: 1801
21655 #SUP: 2666
21779 #SUP: 3352
21916 #SUP: 1625
22216 #SUP: 2016
22316 #SUP: 1649
22348 #SUP: 2959
22453 #SUP: 1862
22912 #SUP: 2578
23438 #SUP: 3506
23933 #SUP: 1683
24138 #SUP: 2197
24367 #SUP: 1600
24891 #SUP: 2616
25127 #SUP: 1728
25306 #SUP: 1666
25442 #SUP: 1607
25473 #SUP: 2682
25877 #SUP: 2097
25889 #SUP: 2790
26027 #SUP: 1689
26253 #SUP: 4188
26375 #SUP: 2101
26460 #SUP: 2670
26521 #SUP: 5674
27079 #SUP: 3579
27101 #SUP: 1697
29017 #SUP: 2336
29189 #SUP: 2152
29243 #SUP: 1593
29279 #SUP: 4725
29608 #SUP: 2438
29959 #SUP: 1883
30312 #SUP: 1691
30933 #SUP: 4128
31501 #SUP: 2246
33513 #SUP: 3225
33776 #SUP: 1680
34691 #SUP: 1614
34762 #SUP: 1976
34837 #SUP: 5695
34839 #SUP: 2720
35215 #SUP: 2690
35987 #SUP: 3596
36595 #SUP: 1664
37228 #SUP: 1788
37278 #SUP: 5327
37356 #SUP: 2692
37670 #SUP: 1749
37811 #SUP: 3610
38345 #SUP: 2721
38347 #SUP: 5886
38507 #SUP: 1637
40448 #SUP: 3389
40474 #SUP: 3363
42999 #SUP: 1616
43333 #SUP: 2109
44543 #SUP: 2499
45336 #SUP: 1959
45646 #SUP: 2624
45718 #SUP: 1729
45750 #SUP: 1905
46073 #SUP: 1847
47510 #SUP: 3217
47552 #SUP: 4989
48035 #SUP: 3220
48534 #SUP: 2002
49068 #SUP: 2985
49335 #SUP: 1670
53968 #SUP: 2453
55306 #SUP: 2164
55503 #SUP: 2971
343 358  #SUP: 4193
343 1347  #SUP: 4188
358 1347  #SUP: 4213
8033 8040  #SUP: 7035
11788 44543  #SUP: 2043
17550 47510  #SUP: 2000
17550 48035  #SUP: 2000
22348 55503  #SUP: 2938
24891 45646  #SUP: 2582
47510 48035  #SUP: 3138
343 358 1347  #SUP: 4188
17550 47510 48035  #SUP: 2000
STDERR:

In [15]:
items_amount = 2

new_content = ""
with open(output_file, 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        if len(line.split(" ")) > items_amount + 1:
            new_line = ""
            for item in line.split("  ")[0].split(" "):
                new_line += int_to_product[int(item)] + " "
            new_line += line.split("  ")[1]
            new_content += new_line

with open("./spmf/filtered_apriori.txt", "w") as f:
    f.write(new_content)

print(new_content)

0003302245 0006155480 #SUP: 4193
0003302245 0007271190 #SUP: 4188
0006155480 0007271190 #SUP: 4213
0060846755 0060846178 #SUP: 7035
0061791644 0300208421 #SUP: 2043
0062571370 0307461068 #SUP: 2000
0062571370 0307594718 #SUP: 2000
0073522465 0312382812 #SUP: 2938
0130231207 0307262812 #SUP: 2582
0307461068 0307594718 #SUP: 3138
0003302245 0006155480 0007271190 #SUP: 4188
0062571370 0307461068 0307594718 #SUP: 2000

In [16]:
import pandas as pd

products = pd.read_csv("./data/all_products_simplified.csv")
products.head()

,id,categories,brand,features,price,date
0,0000092878,[],Keith Graham,[],39.94,19700101
1,000047715X,"[89792, 105868, 122041]",Acp,[],0.00,19700101
2,0000004545,"[89792, 77019, 12065]",Burkhard Jarisch,[],199.99,19700101
3,0000013765,"[89792, 77019, 12065]",Stamps/Baxter,[],0.00,19700101
4,0000477141,"[89792, 25301, 6735]",ACP,[],0.00,19700101

In [17]:
from IPython.display import display

dfs = []

with open("./spmf/filtered_apriori.txt", 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        result = products[products["id"].isin(line.split(" ")[:-2])].copy()
        result["pattern_amount"] = int(line.split(" ")[-1])
        dfs.append(result)

dfs = sorted(dfs, key=lambda x: x.iloc[0]["pattern_amount"], reverse=True)
for df in dfs:
    display(df)

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,7035
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,7035

,id,categories,brand,features,price,date,pattern_amount
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4213
4204,0007271190,[],Visit Amazon's Conn Iggulden Page,[],12.70,19700101,4213

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.00,19700101,4193
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4193

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.0,19700101,4188
4204,0007271190,[],Visit Amazon's Conn Iggulden Page,[],12.7,19700101,4188

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.00,19700101,4188
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4188
4204,0007271190,[],Visit Amazon's Conn Iggulden Page,[],12.70,19700101,4188

,id,categories,brand,features,price,date,pattern_amount
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,3138
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,3138

,id,categories,brand,features,price,date,pattern_amount
54357,0073522465,"[89792, 12816, 35623]",Robert Feldman,[],0.00,19700101,2938
176458,0312382812,"[89792, 31458, 45118]",Visit Amazon's Sibley Miller Page,[],7.99,19700101,2938

,id,categories,brand,features,price,date,pattern_amount
65935,0130231207,"[89792, 41246, 79314]",Visit Amazon's Robert L. Mott Page,[],0.00,19700101,2582
155783,0307262812,"[89792, 12438, 14269]",Visit Amazon's Wibke Bruhns Page,[],8.92,19700101,2582

,id,categories,brand,features,price,date,pattern_amount
29854,0061791644,"[89792, 6375, 64303]",Visit Amazon's Selena Roberts Page,[],4.74,19700101,2043
151984,0300208421,"[89792, 77019, 9904]",Visit Amazon's Irving Sandler Page,[],49.98,19700101,2043

,id,categories,brand,features,price,date,pattern_amount
37798,0062571370,"[89792, 93327, 56691]",Visit Amazon's Mark Salisbury Page,[],32.02,19700101,2000
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,2000

,id,categories,brand,features,price,date,pattern_amount
37798,0062571370,"[89792, 93327, 56691]",Visit Amazon's Mark Salisbury Page,[],32.02,19700101,2000
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,2000

,id,categories,brand,features,price,date,pattern_amount
37798,0062571370,"[89792, 93327, 56691]",Visit Amazon's Mark Salisbury Page,[],32.02,19700101,2000
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,2000
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,2000

In [18]:
import subprocess

spmf_jar_path = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf.jar"

input_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\input.txt"
output_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\fp_growth.txt"

process = subprocess.Popen([r'C:\Program Files\Java\jdk-20\bin\java', '-jar', spmf_jar_path, 'run', 'FPGrowth_itemsets', input_file, output_file, '1%'],
                           stderr=subprocess.PIPE)

stdout, stderr = process.communicate()
print("STDERR:", stderr.decode())

with open(output_file, 'r') as f:
    for line in f:
        print(line.strip())

STDERR:
6563 #SUP: 6550
7586 #SUP: 6828
8033 #SUP: 7548
8033 8040 #SUP: 7548
8033 8040 #SUP: 956
8033 8040 8040 #SUP: 956
8033 8040 #SUP: 162
8033 8040 8040 #SUP: 162
8033 8040 8040 #SUP: 162
8033 8040 8040 8040 #SUP: 162
8033 8040 #SUP: 28
8033 8040 8040 #SUP: 28
8033 8040 8040 #SUP: 28
8033 8040 8040 8040 #SUP: 28
8033 8040 8040 #SUP: 28
8033 8040 8040 8040 #SUP: 28
8033 8040 8040 8040 #SUP: 28
8033 8040 8040 8040 8040 #SUP: 28
8040 #SUP: 7908

In [19]:
items_amount = 2

new_content = ""
with open(output_file, 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        if len(line.split(" ")) > items_amount + 1:
            new_line = ""
            for item in line.split(" ")[:-2]:
                new_line += int_to_product[int(item)] + " "
            new_line += " " + " ".join(line.split(" ")[-2:])
            new_content += new_line

with open("./spmf/filtered_fp_growth.txt", "w") as f:
    f.write(new_content)

print(new_content)

0060846755 0060846178  #SUP: 7548
0060846755 0060846178  #SUP: 956
0060846755 0060846178 0060846178  #SUP: 956
0060846755 0060846178  #SUP: 162
0060846755 0060846178 0060846178  #SUP: 162
0060846755 0060846178 0060846178  #SUP: 162
0060846755 0060846178 0060846178 0060846178  #SUP: 162
0060846755 0060846178  #SUP: 28
0060846755 0060846178 0060846178  #SUP: 28
0060846755 0060846178 0060846178  #SUP: 28
0060846755 0060846178 0060846178 0060846178  #SUP: 28
0060846755 0060846178 0060846178  #SUP: 28
0060846755 0060846178 0060846178 0060846178  #SUP: 28
0060846755 0060846178 0060846178 0060846178  #SUP: 28
0060846755 0060846178 0060846178 0060846178 0060846178  #SUP: 28

In [20]:
from IPython.display import display

dfs = []

with open("./spmf/filtered_fp_growth.txt", 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        result = products[products["id"].isin(line.split(" ")[:-2])].copy()
        result["pattern_amount"] = int(line.split(" ")[-1])
        dfs.append(result)

dfs = sorted(dfs, key=lambda x: x.iloc[0]["pattern_amount"], reverse=True)
for df in dfs:
    display(df)

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,7548
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,7548

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,956
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,956

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,956
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,956

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,162
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,162

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,162
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,162

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,162
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,162

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,162
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,162

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,28
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,28

In [21]:
import subprocess

spmf_jar_path = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\spmf.jar"

input_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\input.txt"
output_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\n_eclat_closed.txt"

process = subprocess.Popen([r'C:\Program Files\Java\jdk-20\bin\java', '-jar', spmf_jar_path, 'run', 'NEclatClosed', input_file, output_file, '0.25%'],
                           stderr=subprocess.PIPE)
stdout, stderr = process.communicate()
print("STDERR:", stderr.decode())

with open(output_file, 'r') as f:
    for line in f:
        print(line.strip())

items_amount = 2

new_content = ""
with open(output_file, 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        if len(line.split(" ")) > items_amount + 1:
            new_line = ""
            for item in line.split(" ")[:-2]:
                new_line += int_to_product[int(item)] + " "
            new_line += " " + " ".join(line.split(" ")[-2:])
            new_content += new_line

with open("./spmf/filtered_n_eclat_closed.txt", "w") as f:
    f.write(new_content)


dfs = []

with open("./spmf/filtered_n_eclat_closed.txt", 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        result = products[products["id"].isin(line.split(" ")[:-2])].copy()
        result["pattern_amount"] = int(line.split(" ")[-1])
        dfs.append(result)

dfs = sorted(dfs, key=lambda x: x.iloc[0]["pattern_amount"], reverse=True)
for df in dfs:
    display(df)

STDERR:
29243 #SUP: 1593
15141 #SUP: 1569
24367 #SUP: 1589
2664 #SUP: 1606
25442 #SUP: 1603
34691 #SUP: 1614
17225 #SUP: 1615
42999 #SUP: 1463
10429 #SUP: 1622
7272 #SUP: 802
21916 #SUP: 1625
10283 #SUP: 1621
7801 #SUP: 818
38507 #SUP: 1637
22316 #SUP: 1649
36595 #SUP: 1662
12783 #SUP: 1663
25306 #SUP: 1666
49335 #SUP: 1663
33776 #SUP: 1671
23933 #SUP: 1681
26027 #SUP: 1689
30312 #SUP: 1690
679 #SUP: 1695
27101 #SUP: 1691
10426 #SUP: 1614
3816 #SUP: 1711
13455 #SUP: 1704
7220 #SUP: 847
25127 #SUP: 1728
45718 #SUP: 1729
1774 #SUP: 1730
20270 #SUP: 1738
21514 #SUP: 1683
19940 #SUP: 1745
37670 #SUP: 1749
16075 #SUP: 1761
1180 #SUP: 1784
37228 #SUP: 1778
21592 #SUP: 1801
4906 #SUP: 1802
14170 #SUP: 1802
15402 #SUP: 1818
905 #SUP: 1768
10736 #SUP: 1816
46073 #SUP: 1847
16205 #SUP: 1849
22453 #SUP: 1859
14171 #SUP: 1878
29959 #SUP: 1883
45750 #SUP: 1905
6536 #SUP: 962
18178 #SUP: 1947
45336 #SUP: 1952
34762 #SUP: 1970
17138 #SUP: 1992
48534 #SUP: 1993
22216 #SUP: 2006
15446 #SUP: 2027
6611 #SUP: 1017
15749 #SUP: 2051
7241 #SUP: 1036
11788 #SUP: 2059
11788 44543 #SUP: 2047
7304 #SUP: 1045
17550 #SUP: 2067
17550 47510 48035 #SUP: 2003
11391 #SUP: 2095
25877 #SUP: 2008
26375 #SUP: 2101
43333 #SUP: 2085
15976 #SUP: 2117
12924 #SUP: 2139
4298 #SUP: 2136
29189 #SUP: 2144
55306 #SUP: 2164
24138 #SUP: 2197
18319 #SUP: 2101
12713 #SUP: 2091
6696 #SUP: 1106
3168 #SUP: 2214
31501 #SUP: 2213
2160 #SUP: 2229
29017 #SUP: 2277
4804 #SUP: 2339
1763 #SUP: 2322
6680 #SUP: 1187
13399 #SUP: 2279
29608 #SUP: 2438
17614 #SUP: 2450
53968 #SUP: 2452
18372 #SUP: 2406
7345 #SUP: 1242
44543 #SUP: 2476
7243 #SUP: 1250
22912 #SUP: 2556
24891 #SUP: 2602
24891 45646 #SUP: 2590
45646 #SUP: 2608
21655 #SUP: 2666
26460 #SUP: 2670
25473 #SUP: 2681
35215 #SUP: 2648
37356 #SUP: 2692
34839 #SUP: 2719
38345 #SUP: 2721
15328 #SUP: 2762
25889 #SUP: 2760
7831 #SUP: 1396
18350 #SUP: 2804
11367 #SUP: 2798
6903 #SUP: 1448
5014 #SUP: 2931
10475 #SUP: 2915
22348 #SUP: 2959
22348 55503 #SUP: 2944
55503 #SUP: 2971
49068 #SUP: 2961
17772 #SUP: 2996
17991 #SUP: 3075
47510 #SUP: 3143
47510 48035 #SUP: 3141
48035 #SUP: 3143
33513 #SUP: 3204
21779 #SUP: 3352
40474 #SUP: 3363
18367 #SUP: 3251
40448 #SUP: 3388
23438 #SUP: 3506
27079 #SUP: 3579
35987 #SUP: 3596
37811 #SUP: 3609
13850 #SUP: 3631
19847 #SUP: 3762
30933 #SUP: 4127
26253 #SUP: 4188
10125 #SUP: 4146
18344 #SUP: 4177
4396 #SUP: 4198
1347 358 343 #SUP: 4226
358 343 #SUP: 4228
17520 #SUP: 4275
2976 #SUP: 4264
12957 #SUP: 4556
29279 #SUP: 4725
20262 #SUP: 4766
4696 #SUP: 4857
13843 #SUP: 4976
47552 #SUP: 4987
37278 #SUP: 5327
3773 #SUP: 5548
26521 #SUP: 5671
34837 #SUP: 5662
38347 #SUP: 5886
6563 #SUP: 3276
7586 #SUP: 3401
8033 8040 #SUP: 7047
8040 #SUP: 7379

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,7047
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,7047

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.00,19700101,4228
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4228

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.00,19700101,4226
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4226
4204,0007271190,[],Visit Amazon's Conn Iggulden Page,[],12.70,19700101,4226

,id,categories,brand,features,price,date,pattern_amount
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,3141
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,3141

,id,categories,brand,features,price,date,pattern_amount
54357,0073522465,"[89792, 12816, 35623]",Robert Feldman,[],0.00,19700101,2944
176458,0312382812,"[89792, 31458, 45118]",Visit Amazon's Sibley Miller Page,[],7.99,19700101,2944

,id,categories,brand,features,price,date,pattern_amount
65935,0130231207,"[89792, 41246, 79314]",Visit Amazon's Robert L. Mott Page,[],0.00,19700101,2590
155783,0307262812,"[89792, 12438, 14269]",Visit Amazon's Wibke Bruhns Page,[],8.92,19700101,2590

,id,categories,brand,features,price,date,pattern_amount
29854,0061791644,"[89792, 6375, 64303]",Visit Amazon's Selena Roberts Page,[],4.74,19700101,2047
151984,0300208421,"[89792, 77019, 9904]",Visit Amazon's Irving Sandler Page,[],49.98,19700101,2047

,id,categories,brand,features,price,date,pattern_amount
37798,0062571370,"[89792, 93327, 56691]",Visit Amazon's Mark Salisbury Page,[],32.02,19700101,2003
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,2003
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,2003

In [22]:
import subprocess

spmf_jar_path = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf.jar"

input_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\input.txt"
output_file = r"C:\Users\RINGULARITY\Desktop\epita\eda\eda_project\spmf\neg_fin.txt"

process = subprocess.Popen([r'C:\Program Files\Java\jdk-20\bin\java', '-jar', spmf_jar_path, 'run', 'NegFIN', input_file, output_file, '0.1%', '0.00001%'],
                           stderr=subprocess.PIPE)
stdout, stderr = process.communicate()
print("STDERR:", stderr.decode())

with open(output_file, 'r') as f:
    for line in f:
        print(line.strip())

items_amount = 2

new_content = ""
with open(output_file, 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        if len(line.split(" ")) > items_amount + 1:
            new_line = ""
            for item in line.split(" ")[:-2]:
                new_line += int_to_product[int(item)] + " "
            new_line += " " + " ".join(line.split(" ")[-2:])
            new_content += new_line

with open("./spmf/filtered_neg_fin.txt", "w") as f:
    f.write(new_content)


dfs = []

with open("./spmf/filtered_neg_fin.txt", 'r') as f:
    while True:
        line = f.readline()
        if not line:
            break
        
        result = products[products["id"].isin(line.split(" ")[:-2])].copy()
        result["pattern_amount"] = int(line.split(" ")[-1])
        dfs.append(result)

dfs = sorted(dfs, key=lambda x: x.iloc[0]["pattern_amount"], reverse=True)
for df in dfs:
    display(df)

STDERR:
49819 #SUP: 639
11637 #SUP: 639
10780 #SUP: 639
30924 #SUP: 640
15611 #SUP: 640
50452 #SUP: 642
13355 #SUP: 643
11804 #SUP: 644
11804 45669 #SUP: 643
32842 #SUP: 645
10093 #SUP: 645
5899 #SUP: 645
45669 #SUP: 646
12075 #SUP: 646
17985 #SUP: 648
7723 #SUP: 648
41728 #SUP: 649
40180 #SUP: 649
28646 #SUP: 650
8839 #SUP: 650
42250 #SUP: 652
7452 #SUP: 652
31280 #SUP: 653
45573 #SUP: 654
34096 #SUP: 654
45311 #SUP: 655
41039 #SUP: 655
16365 #SUP: 655
46086 #SUP: 656
22529 #SUP: 656
16035 #SUP: 656
7111 #SUP: 657
13253 #SUP: 658
13000 #SUP: 659
41062 #SUP: 660
15592 #SUP: 660
34239 #SUP: 661
14904 #SUP: 662
7702 #SUP: 662
6894 #SUP: 662
18524 #SUP: 664
35632 #SUP: 665
28326 #SUP: 666
651 #SUP: 666
54415 #SUP: 667
47289 #SUP: 668
23394 #SUP: 668
6492 #SUP: 669
42449 #SUP: 671
11035 #SUP: 671
43221 #SUP: 672
37866 #SUP: 672
6374 #SUP: 672
8830 #SUP: 673
15373 #SUP: 674
379 #SUP: 674
13136 #SUP: 675
35376 #SUP: 676
9572 #SUP: 676
1624 #SUP: 677
25474 #SUP: 678
45823 #SUP: 679
27510 #SUP: 679
7570 #SUP: 679
7282 #SUP: 679
6528 #SUP: 679
33324 #SUP: 680
30679 #SUP: 680
25112 #SUP: 681
20387 #SUP: 681
53500 #SUP: 682
18006 #SUP: 683
14004 #SUP: 683
35800 #SUP: 685
44205 #SUP: 687
19687 #SUP: 688
13759 #SUP: 688
25630 #SUP: 689
32793 #SUP: 690
25291 #SUP: 690
43491 #SUP: 691
42051 #SUP: 692
29620 #SUP: 692
31132 #SUP: 694
50382 #SUP: 695
46224 #SUP: 695
45717 #SUP: 695
45717 20057 #SUP: 695
43222 #SUP: 695
48374 #SUP: 697
48374 25786 #SUP: 694
25786 #SUP: 697
20057 #SUP: 697
8197 #SUP: 697
15273 #SUP: 698
23925 #SUP: 700
7193 #SUP: 701
507 #SUP: 701
48548 #SUP: 703
38221 #SUP: 703
29123 #SUP: 703
1265 #SUP: 704
1265 8649 #SUP: 704
22904 #SUP: 705
54434 #SUP: 706
54434 18789 #SUP: 702
36167 #SUP: 706
35104 #SUP: 706
8649 #SUP: 707
43075 #SUP: 708
34223 #SUP: 708
18556 #SUP: 709
17716 #SUP: 709
2842 #SUP: 709
48539 #SUP: 710
44765 #SUP: 710
24665 #SUP: 710
25036 #SUP: 711
23708 #SUP: 711
18789 #SUP: 711
51427 #SUP: 712
21598 #SUP: 712
54236 #SUP: 713
39202 #SUP: 713
14403 #SUP: 714
42184 #SUP: 715
17079 #SUP: 718
6858 #SUP: 720
4500 #SUP: 720
55619 #SUP: 721
2419 #SUP: 721
2419 36803 #SUP: 691
21705 #SUP: 723
2407 #SUP: 723
40399 #SUP: 724
24137 #SUP: 724
13142 #SUP: 724
7290 #SUP: 724
6614 #SUP: 724
14056 #SUP: 725
20337 #SUP: 727
7233 #SUP: 727
16047 #SUP: 729
48311 #SUP: 730
13338 #SUP: 731
27076 #SUP: 733
23417 #SUP: 733
11500 #SUP: 733
34295 #SUP: 734
10939 #SUP: 735
36803 #SUP: 736
15909 #SUP: 736
24486 #SUP: 739
11965 #SUP: 740
8156 #SUP: 740
37791 #SUP: 741
34981 #SUP: 741
7704 #SUP: 743
7096 #SUP: 743
25902 #SUP: 744
17257 #SUP: 744
31916 #SUP: 746
29965 #SUP: 748
6461 #SUP: 749
1302 #SUP: 750
28311 #SUP: 752
25589 #SUP: 752
50867 #SUP: 753
55951 #SUP: 756
6607 #SUP: 759
30737 #SUP: 760
30682 #SUP: 760
17865 #SUP: 760
36203 #SUP: 762
31301 #SUP: 764
30470 #SUP: 764
29550 #SUP: 765
19334 #SUP: 765
22437 #SUP: 766
48650 #SUP: 770
44663 #SUP: 770
33377 #SUP: 770
1349 #SUP: 770
45819 #SUP: 772
45819 39309 #SUP: 772
45819 51112 #SUP: 772
45819 39309 51112 #SUP: 772
45819 32120 #SUP: 771
45819 32120 39309 #SUP: 771
45819 32120 51112 #SUP: 771
45819 32120 39309 51112 #SUP: 771
39309 #SUP: 772
39309 51112 #SUP: 772
39309 32120 #SUP: 771
39309 32120 51112 #SUP: 771
30524 #SUP: 772
13402 #SUP: 772
7239 #SUP: 772
51112 #SUP: 773
51112 32120 #SUP: 771
2731 #SUP: 773
52397 #SUP: 774
25971 #SUP: 775
21415 #SUP: 777
13676 #SUP: 778
50360 #SUP: 779
50360 20976 #SUP: 744
33483 #SUP: 780
7436 #SUP: 780
6668 #SUP: 780
6326 #SUP: 780
3333 #SUP: 783
23229 #SUP: 786
32120 #SUP: 787
40236 #SUP: 788
13918 #SUP: 790
46140 #SUP: 792
17043 #SUP: 792
6121 #SUP: 792
34840 #SUP: 793
7323 #SUP: 793
26143 #SUP: 796
41830 #SUP: 797
15778 #SUP: 799
15529 #SUP: 800
12272 #SUP: 800
13311 #SUP: 801
5630 #SUP: 801
14355 #SUP: 802
10271 #SUP: 803
40581 #SUP: 804
16127 #SUP: 804
17294 #SUP: 805
44120 #SUP: 806
44120 43729 #SUP: 806
43729 #SUP: 806
41908 #SUP: 806
14740 #SUP: 809
1770 #SUP: 810
39034 #SUP: 811
694 #SUP: 813
694 674 #SUP: 813
694 7272 #SUP: 813
694 674 7272 #SUP: 813
674 #SUP: 813
674 7272 #SUP: 813
9684 #SUP: 814
6363 #SUP: 815
2008 #SUP: 816
40657 #SUP: 818
7833 #SUP: 819
43656 #SUP: 820
17924 #SUP: 820
14714 #SUP: 821
29477 #SUP: 822
21165 #SUP: 823
10132 #SUP: 823
29426 #SUP: 824
22549 #SUP: 824
7070 #SUP: 825
29779 #SUP: 827
50830 #SUP: 829
34416 #SUP: 830
7287 #SUP: 830
460 #SUP: 830
46854 #SUP: 832
21299 #SUP: 832
28250 #SUP: 833
37983 #SUP: 834
45719 #SUP: 835
29427 #SUP: 835
21152 #SUP: 836
10632 #SUP: 839
24147 #SUP: 841
8087 #SUP: 841
10448 #SUP: 842
6529 #SUP: 842
33833 #SUP: 843
28892 #SUP: 844
11979 #SUP: 844
23947 #SUP: 845
45896 #SUP: 849
39755 #SUP: 849
34348 #SUP: 849
7316 #SUP: 849
39899 #SUP: 850
39274 #SUP: 850
17675 #SUP: 850
29509 #SUP: 851
10285 #SUP: 851
13128 #SUP: 852
34877 #SUP: 853
10953 #SUP: 856
10806 #SUP: 859
9866 #SUP: 865
45715 #SUP: 867
32860 #SUP: 868
57404 #SUP: 869
43849 #SUP: 869
14404 #SUP: 869
22045 #SUP: 872
25820 #SUP: 873
2434 #SUP: 874
2434 45999 #SUP: 861
13910 #SUP: 876
45999 #SUP: 881
47949 #SUP: 882
31699 #SUP: 882
39668 #SUP: 883
30167 #SUP: 885
6761 #SUP: 885
6761 6757 #SUP: 885
6757 #SUP: 885
7735 #SUP: 886
2113 #SUP: 886
36957 #SUP: 888
12193 #SUP: 889
31332 #SUP: 890
2285 #SUP: 897
1693 #SUP: 898
160 #SUP: 898
15135 #SUP: 899
50368 #SUP: 903
39866 #SUP: 907
1284 #SUP: 907
16308 #SUP: 908
39514 #SUP: 910
39976 #SUP: 911
28655 #SUP: 911
38134 #SUP: 916
24246 #SUP: 918
5363 #SUP: 919
5363 2626 #SUP: 919
2626 #SUP: 919
46769 #SUP: 920
17376 #SUP: 922
42677 #SUP: 925
27638 #SUP: 926
3916 #SUP: 926
45136 #SUP: 930
48538 #SUP: 931
26880 #SUP: 932
17722 #SUP: 933
27199 #SUP: 934
22820 #SUP: 939
47065 #SUP: 941
34541 #SUP: 941
14660 #SUP: 944
11909 #SUP: 945
12267 #SUP: 946
147 #SUP: 946
15217 #SUP: 948
14400 #SUP: 948
2617 #SUP: 948
27069 #SUP: 952
1410 #SUP: 952
49626 #SUP: 953
9295 #SUP: 957
45984 #SUP: 958
57076 #SUP: 961
7245 #SUP: 961
37741 #SUP: 962
8396 #SUP: 962
10169 #SUP: 963
5709 #SUP: 963
40534 #SUP: 965
14413 #SUP: 965
27007 #SUP: 968
24900 #SUP: 968
41458 #SUP: 969
11080 #SUP: 969
26300 #SUP: 971
40475 #SUP: 973
44778 #SUP: 974
30339 #SUP: 975
7268 #SUP: 978
7638 #SUP: 985
9479 #SUP: 987
42358 #SUP: 988
14281 #SUP: 988
44296 #SUP: 990
8001 #SUP: 991
8370 #SUP: 992
7593 #SUP: 993
38423 #SUP: 995
33933 #SUP: 997
25113 #SUP: 997
7229 #SUP: 999
33398 #SUP: 1006
34902 #SUP: 1011
3891 #SUP: 1014
366 #SUP: 1015
39191 #SUP: 1016
4224 #SUP: 1017
17879 #SUP: 1018
36596 #SUP: 1019
23212 #SUP: 1020
7676 #SUP: 1021
19415 #SUP: 1025
11897 #SUP: 1026
6577 #SUP: 1026
44259 #SUP: 1027
23847 #SUP: 1027
6625 #SUP: 1030
11808 #SUP: 1031
5311 #SUP: 1034
3240 #SUP: 1035
40778 #SUP: 1036
22526 #SUP: 1036
25617 #SUP: 1045
25617 45104 #SUP: 1043
50717 #SUP: 1046
13083 #SUP: 1047
14153 #SUP: 1048
45104 #SUP: 1050
43843 #SUP: 1050
20976 #SUP: 1050
1136 #SUP: 1057
42998 #SUP: 1059
2855 #SUP: 1059
27474 #SUP: 1065
21515 #SUP: 1067
50079 #SUP: 1072
50079 19304 #SUP: 1065
38317 #SUP: 1073
50861 #SUP: 1074
7590 #SUP: 1074
46110 #SUP: 1075
32659 #SUP: 1075
7934 #SUP: 1076
7122 #SUP: 1078
43786 #SUP: 1080
26511 #SUP: 1080
3533 #SUP: 1080
48537 #SUP: 1082
14396 #SUP: 1082
11862 #SUP: 1088
8493 #SUP: 1089
12930 #SUP: 1090
12455 #SUP: 1092
27175 #SUP: 1096
9593 #SUP: 1097
9593 9523 #SUP: 1097
26690 #SUP: 1099
9523 #SUP: 1099
21544 #SUP: 1100
17476 #SUP: 1100
8788 #SUP: 1106
3202 #SUP: 1107
7491 #SUP: 1118
14708 #SUP: 1120
50333 #SUP: 1124
23156 #SUP: 1128
23676 #SUP: 1131
16066 #SUP: 1140
42028 #SUP: 1142
48784 #SUP: 1148
41687 #SUP: 1150
38545 #SUP: 1152
39880 #SUP: 1157
33009 #SUP: 1162
20400 #SUP: 1163
30226 #SUP: 1164
15093 #SUP: 1168
31850 #SUP: 1169
25675 #SUP: 1170
38344 #SUP: 1171
12908 #SUP: 1176
5742 #SUP: 1179
8487 #SUP: 1180
8679 #SUP: 1185
6829 #SUP: 1188
13400 #SUP: 1193
29156 #SUP: 1199
1128 #SUP: 1200
51327 #SUP: 1201
14709 #SUP: 1201
28100 #SUP: 1207
43842 #SUP: 1211
46263 #SUP: 1213
46263 45312 #SUP: 1213
45312 #SUP: 1213
7563 #SUP: 1214
20722 #SUP: 1215
22276 #SUP: 1216
16172 #SUP: 1216
29585 #SUP: 1217
26389 #SUP: 1222
7642 #SUP: 1223
39267 #SUP: 1224
334 #SUP: 1225
41124 #SUP: 1232
38343 #SUP: 1234
19197 #SUP: 1236
12545 #SUP: 1237
29377 #SUP: 1239
29894 #SUP: 1240
7025 #SUP: 1241
29362 #SUP: 1244
28060 #SUP: 1245
27174 #SUP: 1246
5909 #SUP: 1246
10029 #SUP: 1247
28247 #SUP: 1251
21303 #SUP: 1251
8729 #SUP: 1253
14422 #SUP: 1256
20146 #SUP: 1257
7248 #SUP: 1258
49877 #SUP: 1259
40506 #SUP: 1260
2259 #SUP: 1262
9481 #SUP: 1268
37980 #SUP: 1269
11727 #SUP: 1272
15369 #SUP: 1274
17502 #SUP: 1276
17502 53129 #SUP: 1265
53129 #SUP: 1278
40607 #SUP: 1282
4949 #SUP: 1283
25489 #SUP: 1289
9834 #SUP: 1296
6587 #SUP: 1298
23863 #SUP: 1304
11229 #SUP: 1308
13640 #SUP: 1312
6356 #SUP: 1314
35422 #SUP: 1329
28493 #SUP: 1343
30422 #SUP: 1346
22452 #SUP: 1349
37053 #SUP: 1350
2934 #SUP: 1352
2547 #SUP: 1354
5981 #SUP: 1358
51000 #SUP: 1363
13839 #SUP: 1363
11060 #SUP: 1363
4766 #SUP: 1364
39992 #SUP: 1368
39992 13455 #SUP: 853
16897 #SUP: 1368
18039 #SUP: 1382
15101 #SUP: 1384
6931 #SUP: 1384
6038 #SUP: 1384
40610 #SUP: 1386
39263 #SUP: 1392
25674 #SUP: 1402
6737 #SUP: 1413
19304 #SUP: 1427
42450 #SUP: 1428
54406 #SUP: 1431
37984 #SUP: 1436
32747 #SUP: 1438
17639 #SUP: 1441
13161 #SUP: 1443
30724 #SUP: 1446
5512 #SUP: 1451
5512 8337 #SUP: 1451
8337 #SUP: 1452
30834 #SUP: 1454
49333 #SUP: 1455
17379 #SUP: 1460
31590 #SUP: 1463
21219 #SUP: 1464
2061 #SUP: 1478
3595 #SUP: 1479
13352 #SUP: 1480
11698 #SUP: 1502
48621 #SUP: 1508
10645 #SUP: 1518
24453 #SUP: 1521
29688 #SUP: 1523
21012 #SUP: 1523
7091 #SUP: 1524
20177 #SUP: 1529
19855 #SUP: 1529
7594 #SUP: 1531
35213 #SUP: 1537
7423 #SUP: 1537
29499 #SUP: 1543
19040 #SUP: 1545
29990 #SUP: 1550
213 #SUP: 1550
21375 #SUP: 1551
36601 #SUP: 1569
9483 #SUP: 1575
12921 #SUP: 1579
26632 #SUP: 1586
29243 #SUP: 1593
15141 #SUP: 1596
24367 #SUP: 1600
2664 #SUP: 1606
25442 #SUP: 1607
34691 #SUP: 1614
17225 #SUP: 1615
42999 #SUP: 1616
10429 #SUP: 1622
7272 #SUP: 1623
21916 #SUP: 1625
10283 #SUP: 1627
7801 #SUP: 1632
38507 #SUP: 1637
22316 #SUP: 1649
36595 #SUP: 1664
12783 #SUP: 1665
25306 #SUP: 1666
49335 #SUP: 1670
33776 #SUP: 1680
23933 #SUP: 1683
26027 #SUP: 1689
30312 #SUP: 1691
679 #SUP: 1695
27101 #SUP: 1697
10426 #SUP: 1698
3816 #SUP: 1712
13455 #SUP: 1717
7220 #SUP: 1719
25127 #SUP: 1728
45718 #SUP: 1729
1774 #SUP: 1737
20270 #SUP: 1740
21514 #SUP: 1742
19940 #SUP: 1745
37670 #SUP: 1749
16075 #SUP: 1766
1180 #SUP: 1785
37228 #SUP: 1788
21592 #SUP: 1801
4906 #SUP: 1802
14170 #SUP: 1803
15402 #SUP: 1818
905 #SUP: 1819
10736 #SUP: 1828
46073 #SUP: 1847
16205 #SUP: 1857
22453 #SUP: 1862
14171 #SUP: 1878
29959 #SUP: 1883
45750 #SUP: 1905
6536 #SUP: 1922
18178 #SUP: 1947
45336 #SUP: 1959
34762 #SUP: 1976
17138 #SUP: 1998
48534 #SUP: 2002
22216 #SUP: 2016
15446 #SUP: 2028
6611 #SUP: 2030
15749 #SUP: 2051
7241 #SUP: 2072
11788 #SUP: 2074
11788 44543 #SUP: 2062
7304 #SUP: 2087
17550 #SUP: 2089
17550 47510 #SUP: 2025
17550 47510 48035 #SUP: 2025
17550 48035 #SUP: 2025
11391 #SUP: 2096
25877 #SUP: 2097
26375 #SUP: 2101
43333 #SUP: 2109
15976 #SUP: 2119
12924 #SUP: 2139
4298 #SUP: 2145
29189 #SUP: 2152
55306 #SUP: 2164
24138 #SUP: 2197
18319 #SUP: 2202
12713 #SUP: 2205
6696 #SUP: 2213
3168 #SUP: 2236
31501 #SUP: 2246
2160 #SUP: 2246
29017 #SUP: 2336
4804 #SUP: 2370
1763 #SUP: 2375
6680 #SUP: 2380
13399 #SUP: 2391
29608 #SUP: 2438
17614 #SUP: 2450
53968 #SUP: 2453
18372 #SUP: 2463
7345 #SUP: 2483
44543 #SUP: 2499
7243 #SUP: 2527
22912 #SUP: 2578
24891 #SUP: 2616
24891 45646 #SUP: 2604
45646 #SUP: 2624
21655 #SUP: 2666
26460 #SUP: 2670
25473 #SUP: 2682
35215 #SUP: 2690
37356 #SUP: 2692
34839 #SUP: 2720
38345 #SUP: 2721
15328 #SUP: 2762
25889 #SUP: 2790
7831 #SUP: 2800
18350 #SUP: 2805
11367 #SUP: 2823
6903 #SUP: 2892
5014 #SUP: 2931
10475 #SUP: 2936
22348 #SUP: 2959
22348 55503 #SUP: 2944
55503 #SUP: 2971
49068 #SUP: 2985
17772 #SUP: 2997
17991 #SUP: 3075
47510 #SUP: 3217
47510 48035 #SUP: 3215
48035 #SUP: 3220
33513 #SUP: 3225
21779 #SUP: 3352
40474 #SUP: 3363
18367 #SUP: 3385
40448 #SUP: 3389
23438 #SUP: 3506
27079 #SUP: 3579
35987 #SUP: 3596
37811 #SUP: 3610
13850 #SUP: 3643
19847 #SUP: 3764
30933 #SUP: 4128
26253 #SUP: 4188
10125 #SUP: 4211
18344 #SUP: 4212
4396 #SUP: 4222
1347 #SUP: 4240
1347 358 #SUP: 4240
1347 343 #SUP: 4240
1347 358 343 #SUP: 4240
358 #SUP: 4242
358 343 #SUP: 4242
343 #SUP: 4242
17520 #SUP: 4275
2976 #SUP: 4292
12957 #SUP: 4587
29279 #SUP: 4725
20262 #SUP: 4770
4696 #SUP: 4869
13843 #SUP: 4980
47552 #SUP: 4989
37278 #SUP: 5327
3773 #SUP: 5573
26521 #SUP: 5674
34837 #SUP: 5695
38347 #SUP: 5886
6563 #SUP: 6550
7586 #SUP: 6828
8033 #SUP: 7548
8033 8040 #SUP: 7548
8040 #SUP: 7908

,id,categories,brand,features,price,date,pattern_amount
22924,0060846178,"[89792, 20014, 117407]",Visit Amazon's Mark Crilley Page,[],8.99,19700101,7548
22944,0060846755,"[89792, 108244, 36162]",Gardner Dozois,[],19.99,19700101,7548

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.00,19700101,4242
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4242

,id,categories,brand,features,price,date,pattern_amount
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4240
4204,0007271190,[],Visit Amazon's Conn Iggulden Page,[],12.70,19700101,4240

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.0,19700101,4240
4204,0007271190,[],Visit Amazon's Conn Iggulden Page,[],12.7,19700101,4240

,id,categories,brand,features,price,date,pattern_amount
1005,0003302245,"[89792, 103424, 21337]",Jan Needle,[],0.00,19700101,4240
1428,0006155480,"[89792, 117407, 92546]",Visit Amazon's Dudley Pope Page,[],1.77,19700101,4240
4204,0007271190,[],Visit Amazon's Conn Iggulden Page,[],12.70,19700101,4240

,id,categories,brand,features,price,date,pattern_amount
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,3215
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,3215

,id,categories,brand,features,price,date,pattern_amount
54357,0073522465,"[89792, 12816, 35623]",Robert Feldman,[],0.00,19700101,2944
176458,0312382812,"[89792, 31458, 45118]",Visit Amazon's Sibley Miller Page,[],7.99,19700101,2944

,id,categories,brand,features,price,date,pattern_amount
65935,0130231207,"[89792, 41246, 79314]",Visit Amazon's Robert L. Mott Page,[],0.00,19700101,2604
155783,0307262812,"[89792, 12438, 14269]",Visit Amazon's Wibke Bruhns Page,[],8.92,19700101,2604

,id,categories,brand,features,price,date,pattern_amount
29854,0061791644,"[89792, 6375, 64303]",Visit Amazon's Selena Roberts Page,[],4.74,19700101,2062
151984,0300208421,"[89792, 77019, 9904]",Visit Amazon's Irving Sandler Page,[],49.98,19700101,2062

,id,categories,brand,features,price,date,pattern_amount
37798,0062571370,"[89792, 93327, 56691]",Visit Amazon's Mark Salisbury Page,[],32.02,19700101,2025
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,2025

,id,categories,brand,features,price,date,pattern_amount
37798,0062571370,"[89792, 93327, 56691]",Visit Amazon's Mark Salisbury Page,[],32.02,19700101,2025
158385,0307461068,"[89792, 50012, 59072]",Lily Chin,[],19.95,19700101,2025
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,2025

,id,categories,brand,features,price,date,pattern_amount
37798,0062571370,"[89792, 93327, 56691]",Visit Amazon's Mark Salisbury Page,[],32.02,19700101,2025
159213,0307594718,"[89792, 108082, 75974]",Visit Amazon's Bruce Hoffman Page,[],11.35,19700101,2025

,id,categories,brand,features,price,date,pattern_amount
18248,0060505885,"[89792, 117407, 103006]",Visit Amazon's Loraine Despres Page,[],0.0,19700101,1451
23664,0060899115,"[89792, 108244, 102065]",Visit Amazon's Fiona McIntosh Page,[],6.0,19700101,1451

,id,categories,brand,features,price,date,pattern_amount
37718,0062562762,"[89792, 58933, 70857]",Visit Amazon's Blue Apron Culinary Team Page,[],15.43,19700101,1265
171667,031220325X,"[89792, 117407, 57648]",Visit Amazon's Laura Joh Rowland Page,[],5.69,19700101,1265

,id,categories,brand,features,price,date,pattern_amount
154830,0307108899,"[89792, 31458, 85440]",Garth Williams,[],0.0,19700101,1213
156968,0307347214,"[89792, 50012, 59072]",Visit Amazon's Amy Karol Page,[],13.1,19700101,1213

,id,categories,brand,features,price,date,pattern_amount
26365,0061139068,"[89792, 108244, 102065]",Visit Amazon's Lois McMaster Bujold Page,[],7.99,19700101,1097
26665,0061173916,"[89792, 117407, 57648]",Visit Amazon's Brendon Burchard Page,[],9.99,19700101,1097

,id,categories,brand,features,price,date,pattern_amount
44592,0071413391,"[89792, 105868, 16597]",Visit Amazon's Denise De R&ocirc;me Page,[],0.00,19700101,1065
163417,0310267757,"[89792, 109750, 31524]",Visit Amazon's Lee Strobel Page,[],7.38,19700101,1065

,id,categories,brand,features,price,date,pattern_amount
69003,0131196014,"[89792, 105868, 122041]",Visit Amazon's Mary Ann Hogan Page,[],0.00,19700101,1043
154177,0306819538,"[89792, 58933, 64617]",Visit Amazon's Alice Feiring Page,[],16.57,19700101,1043

,id,categories,brand,features,price,date,pattern_amount
8026,0023564202,"[89792, 117407, 9904]",Visit Amazon's C. Hugh Holman Page,[],7.97,19700101,919
17977,0060393297,"[89792, 6375, 64303]",Chyna,[],0.00,19700101,919

,id,categories,brand,features,price,date,pattern_amount
20560,0060638621,"[89792, 87761, 117407]",Visit Amazon's Lois T. Henderson Page,[],0.0,19700101,885
20628,0060652861,"[89792, 117407, 103006]",Visit Amazon's Madeleine L'Engle Page,[],0.0,19700101,885

,id,categories,brand,features,price,date,pattern_amount
6612,0008242763,[],NaN,[],15.94,19700101,861
156484,0307277070,"[89792, 117407, 92546]",Visit Amazon's Minette Walters Page,[],15.23,19700101,861

,id,categories,brand,features,price,date,pattern_amount
32197,0062094637,"[89792, 108082, 75974]",Visit Amazon's Adam Freedman Page,[],27.85,19700101,853
121560,0205605508,"[89792, 117407, 9904]",Visit Amazon's Anne Curzan Page,[],0.00,19700101,853

,id,categories,brand,features,price,date,pattern_amount
2279,0006550835,"[89792, 117407, 103006]",Visit Amazon's Doris Lessing Page,[],31.06,19700101,813
2745,0007103077,"[89792, 109750, 70642]",Collins UK,[],14.23,19700101,813

,id,categories,brand,features,price,date,pattern_amount
2745,0007103077,"[89792, 109750, 70642]",Collins UK,[],14.23,19700101,813
21632,0060755784,"[89792, 117407, 92546]",Visit Amazon's Jennifer Haigh Page,[],12.05,19700101,813

,id,categories,brand,features,price,date,pattern_amount
2279,0006550835,"[89792, 117407, 103006]",Visit Amazon's Doris Lessing Page,[],31.06,19700101,813
2745,0007103077,"[89792, 109750, 70642]",Collins UK,[],14.23,19700101,813
21632,0060755784,"[89792, 117407, 92546]",Visit Amazon's Jennifer Haigh Page,[],12.05,19700101,813

,id,categories,brand,features,price,date,pattern_amount
2279,0006550835,"[89792, 117407, 103006]",Visit Amazon's Doris Lessing Page,[],31.06,19700101,813
21632,0060755784,"[89792, 117407, 92546]",Visit Amazon's Jennifer Haigh Page,[],12.05,19700101,813

,id,categories,brand,features,price,date,pattern_amount
147102,0299184544,"[89792, 124098, 57648]",Visit Amazon's Barbara Barber Page,[],7.91,19700101,806
149894,0300113161,"[89792, 105868, 100208]",Visit Amazon's Thomas Sowell Page,[],0.00,19700101,806

,id,categories,brand,features,price,date,pattern_amount
117980,0201309742,"[89792, 64446, 25290]",MindShare Inc.,[],0.00,19700101,772
156065,0307268047,"[89792, 12438, 102506]",Visit Amazon's David Shields Page,[],15.79,19700101,772

,id,categories,brand,features,price,date,pattern_amount
156065,0307268047,"[89792, 12438, 102506]",Visit Amazon's David Shields Page,[],15.79,19700101,772
163830,0310284341,"[89792, 109750, 70642]",Visit Amazon's Charles R. Swindoll Page,[],20.19,19700101,772

,id,categories,brand,features,price,date,pattern_amount
117980,0201309742,"[89792, 64446, 25290]",MindShare Inc.,[],0.00,19700101,772
156065,0307268047,"[89792, 12438, 102506]",Visit Amazon's David Shields Page,[],15.79,19700101,772
163830,0310284341,"[89792, 109750, 70642]",Visit Amazon's Charles R. Swindoll Page,[],20.19,19700101,772

,id,categories,brand,features,price,date,pattern_amount
117980,0201309742,"[89792, 64446, 25290]",MindShare Inc.,[],0.00,19700101,772
163830,0310284341,"[89792, 109750, 70642]",Visit Amazon's Charles R. Swindoll Page,[],20.19,19700101,772

,id,categories,brand,features,price,date,pattern_amount
90266,0142181870,"[89792, 72209, 109886]",Visit Amazon's Annabelle Gurwitch Page,[],15.27,19700101,771
156065,0307268047,"[89792, 12438, 102506]",Visit Amazon's David Shields Page,[],15.79,19700101,771

,id,categories,brand,features,price,date,pattern_amount
90266,0142181870,"[89792, 72209, 109886]",Visit Amazon's Annabelle Gurwitch Page,[],15.27,19700101,771
117980,0201309742,"[89792, 64446, 25290]",MindShare Inc.,[],0.00,19700101,771
156065,0307268047,"[89792, 12438, 102506]",Visit Amazon's David Shields Page,[],15.79,19700101,771

,id,categories,brand,features,price,date,pattern_amount
90266,0142181870,"[89792, 72209, 109886]",Visit Amazon's Annabelle Gurwitch Page,[],15.27,19700101,771
156065,0307268047,"[89792, 12438, 102506]",Visit Amazon's David Shields Page,[],15.79,19700101,771
163830,0310284341,"[89792, 109750, 70642]",Visit Amazon's Charles R. Swindoll Page,[],20.19,19700101,771

,id,categories,brand,features,price,date,pattern_amount
90266,0142181870,"[89792, 72209, 109886]",Visit Amazon's Annabelle Gurwitch Page,[],15.27,19700101,771
117980,0201309742,"[89792, 64446, 25290]",MindShare Inc.,[],0.00,19700101,771
156065,0307268047,"[89792, 12438, 102506]",Visit Amazon's David Shields Page,[],15.79,19700101,771
163830,0310284341,"[89792, 109750, 70642]",Visit Amazon's Charles R. Swindoll Page,[],20.19,19700101,771

,id,categories,brand,features,price,date,pattern_amount
90266,0142181870,"[89792, 72209, 109886]",Visit Amazon's Annabelle Gurwitch Page,[],15.27,19700101,771
117980,0201309742,"[89792, 64446, 25290]",MindShare Inc.,[],0.00,19700101,771

,id,categories,brand,features,price,date,pattern_amount
90266,0142181870,"[89792, 72209, 109886]",Visit Amazon's Annabelle Gurwitch Page,[],15.27,19700101,771
117980,0201309742,"[89792, 64446, 25290]",MindShare Inc.,[],0.00,19700101,771
163830,0310284341,"[89792, 109750, 70642]",Visit Amazon's Charles R. Swindoll Page,[],20.19,19700101,771

,id,categories,brand,features,price,date,pattern_amount
90266,0142181870,"[89792, 72209, 109886]",Visit Amazon's Annabelle Gurwitch Page,[],15.27,19700101,771
163830,0310284341,"[89792, 109750, 70642]",Visit Amazon's Charles R. Swindoll Page,[],20.19,19700101,771

,id,categories,brand,features,price,date,pattern_amount
49287,0071781854,"[89792, 105868, 122041]",Mark Graber,[],0.00,19700101,744
163402,031026295X,"[89792, 109750, 70642]",Gary D. Pratico,[],10.13,19700101,744

,id,categories,brand,features,price,date,pattern_amount
3546,0007196202,"[89792, 117407]",Visit Amazon's Robin Hobb Page,[],10.80,19700101,704
24212,0060936193,"[89792, 117407, 92546]",Visit Amazon's Jeffrey Ford Page,[],11.54,19700101,704

,id,categories,brand,features,price,date,pattern_amount
43055,0071106359,"[89792, 13092, 69095]",Visit Amazon's David M. Burton Page,[],0.00,19700101,702
174650,0312338961,"[89792, 118319, 83967]",Visit Amazon's Randy Sutton Page,[],5.99,19700101,702

,id,categories,brand,features,price,date,pattern_amount
46824,0071494138,"[89792, 108082, 75974]",Visit Amazon's Aamir A. Rehman Page,[],0.00,19700101,695
155893,0307265242,"[89792, 118319, 83967]",Visit Amazon's Steven E. Woodworth Page,[],37.88,19700101,695

,id,categories,brand,features,price,date,pattern_amount
69560,0131408836,"[89792, 105868, 16597]",Visit Amazon's Deborah Phillips Page,[],0.00,19700101,694
160175,0307890074,"[89792, 64446, 4356]",Visit Amazon's Prima Games Page,[],36.98,19700101,694

,id,categories,brand,features,price,date,pattern_amount
6564,0008237972,"[89792, 117407, 92546]",Visit Amazon's Zara Stoneley Page,[],11.99,19700101,691
100282,0174434804,"[89792, 117407, 74808]",William Shakespeare,[],29.95,19700101,691

,id,categories,brand,features,price,date,pattern_amount
30071,0061826871,"[89792, 108244, 102065]",Visit Amazon's Melissa Marr Page,[],0.00,19700101,643
155868,030726291X,"[89792, 117407, 92546]",Visit Amazon's P. D. James Page,[],4.99,19700101,643